cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/versions'

brew 'diff-so-fancy'
brew 'docker'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'grc'
brew 'htop-osx'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'unrar'
brew 'vim', args: ['--override-system-vi']
brew 'wget'
brew 'zsh'

# gnu stuff
brew 'coreutils'
brew 'findutils'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gawk'
brew 'gnutls'
brew 'gnu-indent'
brew 'gnu-getopt'

# antibody
tap 'getantibody/homebrew-antibody'
brew 'antibody'

# casks
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

cask 'diffmerge'
cask 'docker-toolbox'
cask 'font-hack'
cask 'iterm2'
cask 'google-chrome'
cask 'firefox'
cask 'the-unarchiver'
cask 'appcleaner'
cask 'carbon-copy-cloner'
cask 'onyx'
cask 'vlc'
cask 'imageoptim'
cask 'sequel-pro'
cask 'transmission'

# https://github.com/sindresorhus/quick-look-plugins
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
